# hm 1

#str-"რაც ბრჭყალებში იწერება" 
#int-მთელი მთლიანი რიცხვები
#float-რიცხვები როგორიცაა მაგ:5.68
#boolean-true or false

#hm 2

#ცვლადის სახელები არ უნდა შეიცავდეს ზუსტი მნიშვნელობის სიმბოლოებს: მაგალითად, არ შეიძლება ცვლადის სახელში გამოყენებულ იქნას @, #, *, & 
#ცვლადის სახელები არ უნდა იწყებოდეს რიცხვით

#hm 3

    #  num 1 == 10
    #  ----------------
    #  academy = Goal Oriented Academy
    #  ----------------
    #  name = 'Jumbera'
    #  name2 = 'mayvala'
    #  print(name = Name2)
    #  ————————
    #  num = (“30”)
    #  Print(str(num)+20)

    #  academy = Goal Oriented Academy
# აქ ბრჭყალები აკლია
    #  num = (“30”)
#აქ არასწორადაა ბრჭყალები და არც ჭირდება


#hm 4

# input() რომ გამოიტანოს აუთფუთში მომხმარებელმა რაღაც ცვლადის დახმარებით, print() როცა გვინდა დავპრინტოთ ცვლადის შემცველი მონაცემი, str() სტრინგი არის ბრჭყალებში რაც იწერება ნებისმიერი რამ, float() მაგ: 5.7, int()რიცხვი ასევე ცვლადის შემცველი მონაცემი რომელსაც არ სჭირდება არც ბრჩხილი და არც ბრჭყალი

#hm 5

# name = (input("enter your name:"))
# name1 = (input("enter your name:"))

# if name == name1:
#     print("თქვენი სახელი ემთხვევა ჩემს სახელს")
# else:
#     print("თქვენი სახელი არ ემთხვევა ჩემს სახელს")


#hm 6

#print("პროგრამირება არის მაგარი" * 10)

#hm 7

name = ("კახი")
age = int(15)
height = float(input("1.82 ")) 

print(name "არის" age "წლის და მისი სიმაღლე არის" height "მეტრი")

